#### BuiltInFailures.ExportFailures Members

---

|  |
| --- |
| BuiltInFailures ExportFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ExportFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | IFCFatalExportError | There has been an unrecoverable error during export. Export will now be aborted. |
| Public property Static member | IFCFatalToolkitExportError | There has been an unrecoverable error during export. Export will now be aborted. |
| Public property Static member | IFCGenericExportWarning | Unexpected errors occurred while exporting these elements to the IFC file. |
| Public property Static member | SwitchToRasterProcessingInsteadOfVectorWarning | Some of the views have been switched to raster processing though vector processing is selected. |

# See Also

BuiltInFailures ExportFailures Class

Autodesk.Revit.DB Namespace